---
kind: type
id: T:Autodesk.Revit.DB.Group
source: html/ca54af3c-52d8-0aed-cd22-440ec2584b89.htm
---
# Autodesk.Revit.DB.Group

An element representing a single instance of a group of elements that may be placed many times in a project or family.

## Syntax (C#)
```csharp
public class Group : Element
```

## Remarks
Grouping elements is useful when you need to create entities that represent repeating layouts
 or are common to many building projects, such as hotel rooms, apartments, or repeating floors.